app/controllers/clients_controller.rb

INSERT INTO "clients" ("name", "surname", "second_surname", "street", "neighborhood", "city", "state", "zipcode", "rfc", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    @client = Client.new(client_params)
    respond_to do |format|
      if @client.save

UPDATE "clients" SET "rfc" = $1, "updated_at" = $2 WHERE "clients"."id" = $3  [["rfc", "XAXX010101111"], ["updated_at", "2024-11-13 01:59:43.186777"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @client.update(client_params)